{"places":[{"url": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Hemingway_House_Key_West_FL1.jpg","factType": "Museum","index": 0,"content": "Author Hemingway lived in Key West, and there is an annual Hemingway look-alike contest in his honor","color": "rgba(15, 8, 128, 0.8)","href": "https://en.wikipedia.org/wiki/Ernest_Hemingway_House","place": "heminguay","topic": "Hemingway's house","additionalInfo": "The Ernest Hemingway House was the residence of author Ernest Hemingway in Key West, Florida, United States. It is at 907 Whitehead Street, across from the Key West Lighthouse, close to the southern coast of the island. On November 24, 1968, it was designated a U.S. National Historic Landmark. The house was one of the first on the island to be fitted with indoor plumbing and the first on the island to have an upstairs bathroom with running water, fed from a rain cistern on the roof.","images":["https://upload.wikimedia.org/wikipedia/commons/e/e4/Hemingway_House_tourists.jpg","https://upload.wikimedia.org/wikipedia/commons/2/28/Hemingway%27s_pool_2019.jpg","https://upload.wikimedia.org/wikipedia/commons/5/55/Hemingway%27s_den_2019.jpg","https://upload.wikimedia.org/wikipedia/commons/f/fc/Hemingway%27s_writing_desk_in_Key_West.jpg","https://upload.wikimedia.org/wikipedia/commons/2/20/HemingwayHouseFront.jpg","https://upload.wikimedia.org/wikipedia/commons/7/7d/HemingwayGarden.jpg"],"descriptions":["Tourists in Hemingway house","Hemingway's pool","Host room","Hemingway's desktop","The front of the house","Hemingway's garden"]},{"url":"https://upload.wikimedia.org/wikipedia/commons/d/dc/Southernmost_Point_an_der_S%C3%BCdk%C3%BCste_von_Key_West.jpg","factType":"The buoy","index":1,"content":"This is the southernmost point of Key West","color":"rgba(15, 6, 96, 0.8)","href":"https://en.wikipedia.org/wiki/Southernmost_point_buoy","place":"buoy","topic":"The southernmost point","additionalInfo":"The Southernmost Point Buoy is an anchored concrete buoy in Key West, Florida, marking the southernmost point in the continental United States, the lowest latitude land of contiguous North American States. It is 18 feet above sea level. The large painted buoy was established as a tourist attraction in 1983 by the city at the corner of South Street and Whitehead Street. It is one of the most visited and photographed attractions in the United States. The southernmost point was originally marked with a small sign, before the City of Key West erected the now famous concrete buoy in 1983. The concrete buoy has overall withstood several hurricanes and is a gathering place for photographs and tourists. The paint job was damaged by Hurricane Irma in September 2017, but it was refurbished later that year by the original artist supported by the City of Key West which values the landmark as a tourist attraction. Cuba is roughly 90 miles south of this point in Key West, although this was not originally on the marker, but rather on a smaller sign next to marker.","images":["https://upload.wikimedia.org/wikipedia/commons/1/18/The_Southernmost_Point%2C_90_miles_to_Cuba-_Key_West%2C_Florida_%288379456437%29.jpg","https://upload.wikimedia.org/wikipedia/commons/9/99/SOUVENIR_SEASHELLS_FOR_SALE_AT_THE_SOUTHERNMOST_POINT_OF_THE_UNITED_STATES_-_NARA_-_548545.jpg"],"descriptions":["The bouy","Tourists in Hemingway house"]},{"url":"https://upload.wikimedia.org/wikipedia/commons/7/74/Southernmosthouse.jpg","factType":"Historic mansion","index":2,"content":"The Southernmost House is a historic mansion in the U.S. city of Key West","color":"rgba(15, 5, 80, 0.8)","href":"https://en.wikipedia.org/wiki/Southernmost_House","place":"mansion","topic":"The southernmost Mansion","additionalInfo":"The Southernmost House is a historic mansion in the U.S. city of Key West, in Monroe County, Florida. Five U.S. Presidents have stayed there. The house is located in the Upper Duval district and has been converted into a bed and breakfast. Judge Jeptha Vining Harris built the mansion that is now called the Southernmost House in 1897 for $250,000.[1] His wife was the youngest daughter of William Curry, one of Florida’s first millionaires. The Curry family were builders with eight mansions in the Historic District of Key West. The Harris family were prominent citizens at the turn of the century and had invested in Henry Flagler's Overseas Railroad to Key West, often entertaining him at the mansion during the railroad's construction.","images":["https://upload.wikimedia.org/wikipedia/commons/2/2a/Southernmost_House_from_Ocean.jpg","https://upload.wikimedia.org/wikipedia/commons/7/74/Southernmosthouse.jpg"],"descriptions":["View from the ocean","View from the street"]},{"url":"https://upload.wikimedia.org/wikipedia/commons/e/e1/Key_West_FL_HD_Little_White_House04.jpg","factType":"Little White House","index":3,"content":"The Harry S Truman Little White House in Key West, where President Harry S Truman spent 175 days during 11 visits.","color":"rgba(15, 4, 64, 0.8)","href":"https://en.wikipedia.org/wiki/Harry_S._Truman_Little_White_House","place":"white_house","topic":"Harry S. Truman Little White House","additionalInfo":"The Harry S Truman Little White House in Key West, Florida was the winter White House for President Harry S Truman for 175 days during 11 visits. The house is located in the Truman Annex neighborhood of Old Town, Key West. The house was originally waterfront when it was built in 1890 as the first officer's quarters on the submarine base naval station. The house was designed in 1889 by Scott, McDermott & Higgs, a local architectural firm. The wooden duplex contained Quarters A for the base commandant and Quarters B for the paymaster.","images":["https://upload.wikimedia.org/wikipedia/commons/d/d8/Truman-key-1950.gif","https://upload.wikimedia.org/wikipedia/commons/b/b5/Key_road.jpeg"],"descriptions":["Little White House in 1950","Palm trees along a street in the Truman Annex"]},{"url":"https://upload.wikimedia.org/wikipedia/commons/b/bc/Early_morning_Smathers_Beach_Key_West.JPG","factType":"Nice place to relax","index":4,"content":"Smathers Beach is the largest public beach in Key West, Florida, United States. It is approximately a half mile long.","color":"rgba(15, 7, 112, 0.8)","href":"https://en.wikipedia.org/wiki/Smathers_Beach","place":"beach","topic":"Smathers beach","additionalInfo":"Smathers Beach is the largest public beach in Key West, Florida, United States. It is approximately a half mile long. The beach is located on the south side of the island, along the Atlantic Ocean and State Road A1A, and begins at mile marker zero, the beginning of A1A. The beach is lined with coconut trees and is often crowded with tourists and locals alike. On September 2, 2013, long-distance swimmer Diana Nyad arrived on Smathers Beach after swimming 110 miles (166 kilometers) from Havana, Cuba. It was the first time a person had ever swam from Cuba to Florida without a shark cage.","images":["https://upload.wikimedia.org/wikipedia/commons/6/62/Smathers_Beach_closeup.JPG","https://upload.wikimedia.org/wikipedia/commons/b/bc/Early_morning_Smathers_Beach_Key_West.JPG"],"descriptions":["Typical summer day on Smathers Beach.","Early morning on Smathers Beach"]},{"url":"https://upload.wikimedia.org/wikipedia/commons/2/2e/Mallory_Square.JPG","factType":"Nice place for visitors","index":5,"content":"Mallory Square is a plaza located on the waterfront in Key West's historic Old Town.","color":"rgba(15, 9, 144, 0.8)","href":"https://en.wikipedia.org/wiki/Mallory_Square","place":"mallory_square","topic":"Mallory Square","additionalInfo":"Mallory Square is a plaza located in the city of Key West, Florida, U.S. It is located on the waterfront in Key West's historic Old Town, adjacent to the cruise ship port. It is located just west of the northern end of Duval Street, facing the Gulf of Mexico. It runs the entire length of Wall Street. Adjacent to the square are the Key West Shipwreck Historeum Museum and the Old Post Office and Customshouse.","images":["https://upload.wikimedia.org/wikipedia/en/4/4b/Mallory_Square%2C_Key_West%2C_Florida.JPG","https://upload.wikimedia.org/wikipedia/commons/2/2e/Mallory_Square.JPG","https://upload.wikimedia.org/wikipedia/commons/3/32/Key_West_FH020024.jpg","https://upload.wikimedia.org/wikipedia/commons/f/f4/Sunset%2C_Mallory_Square%2C_Key_West%2C_Florida%2C_USA.jpg"],"descriptions":["Mallory Square entrance sign.","Mallory Square as seen from the Gulf of Mexico. Downtown Key West can be seen in the background.","Tourists and the Majesty of the Seas","Sunset"]},{"url":"https://upload.wikimedia.org/wikipedia/commons/c/c6/Aerial_view_of_Fort_Zachary_Taylor_State_Park.jpg","factType":"Fort Zachary Taylor","index":6,"content":"The Fort Zachary Taylor Historic State Park is a Florida State Park and National Historic Landmark centered on a Civil War-era fort.","color":"rgba(15, 3, 48, 0.8)","href":"https://en.wikipedia.org/wiki/Fort_Zachary_Taylor_Historic_State_Park","place":"fort","topic":"Fort Zachary Taylor Historic State Park","additionalInfo":"The Fort Zachary Taylor Historic State Park, better known simply as Fort Taylor (or Fort Zach to locals) is a Florida State Park and National Historic Landmark centered on a Civil War-era fort located near the southern tip of Key West, Florida. Construction of the fort began in 1845 as part of a mid-19th century plan to defend the southeast coast through a series of forts after the War of 1812. Thompson Island, at the southwest tip of Key West, was selected as the site for the fort in 1822 and plans for the fort, drawn up by Simon Bernard and Joseph G. Totten, were approved in 1836. In 1947, the fort, no longer of use to the U.S. Army, was turned over to the U.S. Navy for maintenance. In 1968, volunteers led by Howard S. England excavated Civil War guns and ammunition buried in long-abandoned parts of the fort, which was soon discovered to house the nation's largest collection of Civil War cannons. Fort Taylor was therefore placed on the National Register of Historic Places in 1971 and designated a National Historic Landmark in 1973. Due to the filling in of land around the fort, including the creation of an attractive stretch of beach, the park now occupies 87 acres (352,000 m²).","images":["https://upload.wikimedia.org/wikipedia/commons/3/3f/Fort_taylor.jpg","https://upload.wikimedia.org/wikipedia/commons/c/c6/Aerial_view_of_Fort_Zachary_Taylor_State_Park.jpg","https://upload.wikimedia.org/wikipedia/commons/8/8b/Fort_Zachary_Taylor.JPG"],"descriptions":["Fort Taylor, Florida by Seth Eastman (1808-1875)","Aerial view of Fort Zachary Taylor State Park","The fort as seen from the Gulf of Mexico"]},{"url": "https://upload.wikimedia.org/wikipedia/commons/2/25/Key_lighthouse.jpeg","factType":"Key West Lighthouse","index":7,"content":"The first Key West lighthouse was a 65-foot (20 m) tower completed in 1825. It had 15 lamps in 15-inch (380 mm) reflectors.","color":"rgba(15, 9, 144, 0.8)","href":"https://en.wikipedia.org/wiki/Key_West_Lighthouse","place":"lighthouse","topic":"Key West lighthouse","additionalInfo":"The Key West Lighthouse is located in Key West, Florida. The first Key West lighthouse was a 65-foot (20 m) tower completed in 1825. It had 15 lamps in 15-inch (380 mm) reflectors. The first keeper, Michael Mabrity, died in 1832, and his widow, Barbara, became the lighthouse keeper, serving for 32 years. The Great Havana Hurricane of 1846 destroyed the lighthouse; the USS Morris, which was wrecked during the storm, reported a white sand beach covers the spot where Key West Lighthouse stood. Barbara Mabrity survived, but fourteen people who had sought refuge in the lighthouse tower died, including seven members of her family. (The same hurricane destroyed the Sand Key Lighthouse, eight miles (13 km) away, killing six people, including the keeper, Rebecca Flaherty, another widow of a previous keeper.) Barbara Mabrity continued to serve as keeper of the Key West Light until the early 1860s, when she was fired at age 82 for making statements against the Union (Key West remained under Union control throughout the Civil War).","images":["https://upload.wikimedia.org/wikipedia/commons/9/91/USCGKeywestpre1894.jpg","https://upload.wikimedia.org/wikipedia/commons/a/a7/USCGKeywestpost1894.jpg"],"descriptions":["Original lighthouse, U.S. Coast Guard Archive","Current lighthouse, U.S. Coast Guard Archive"]}],"MainSection":{"services":[{"point":"Contact us","text":"Contact Key West government and administration","href":"https://www.cityofkeywest-fl.gov/egov/apps/services/index.egov?view=detail;id=109"},{"point":"Agendas & Minutes","text":"Find out about upcoming events and meetings at Key West Florida","href":"http://keywest.legistar.com/Calendar.aspx"},{"point":"Parking Information","text":"Learn more about parking rules and pricing at Key West","href":"https://www.cityofkeywest-fl.gov/department/index.php?structureid=18"},{"point":"Key West news","text":"Check out about what happens in Key West","href":"https://www.cityofkeywest-fl.gov/egov/apps/document/center.egov?view=browse&eGov_searchType=46&eGov_searchDepartment=4"}],"content":{"chapter":"Fishing, diving and beaches on idyllic islands","text":"A drive through the Florida Keys and Key West is one of the best scenic road trips in the USA. Only one road connects the 161-kilometer-long island chain: It began as Flagler’s Railroad, became the legendary Overseas Highway and now has been designated an All-American Road under the National Scenic Byways program. The drive has magnificent scenery, significant historic value and an abundance of recreational opportunities, making it a vacation unto itself."}},"video":{"link":"https://www.youtube.com/embed/8Bx5I7z7J6I?autoplay=1","description":{"headline":"Sights of Florida","text":"In this video are shown the most remarkable places of Florida, here you will find Key West"}}}