{
    "links": ["Key West", "Website"],
    "website": {
        "text": [
            {
                "chapter": "Website structure", 
                "paragraph": "This website is written on React js, it is completely responsive. As you noticed there is a lot of the same components that are rendered on different pages, for instance navbars, footer section, headlines, menu items etc. Creating this application a lot of advanced react stuff such as react hooks, fragments, portals was applied. High abstraction level of the components provides extreme reusability (that means components are applied several times for different purposes throughout the application). Application components that calls APIs or making expensive operations e.g. operations or actions, that requires a little bit more time to get done they are written as functional componets that use custom hooks which loads, retrieves information and provides a far better user experience. All of the data, that was retrieved from API calls is stored in the local storage, to be displayed instantly whenever user re-visits some pages. However information that is stored in the local storage updates hourly, this action is triggered by user visiting page one hour later."
            }, 
            {
                "chapter": "About developer", 
                "paragraph": "I am Ilya Nesterow, I was working on solidifying my knowledges of react js and javascript. After reading a lot of concepts from documentations I realised, I need some practice, so I decided to create this website"
            }, 
            {
                "chapter": "About policy", 
                "paragraph": "This website does not tend to use anyone's private data, contrary it provides only data selected from official and public sources. The aim of this web application is to narrate about some aspects, interesting facts etc of Key West, using publicly available data"
            }
        ]
    },
    "keyWest" : {
        "text": [
            {
                "chapter": "Key West", 
                "paragraph": "Is an island in the Straits of Florida, within the U.S. state of Florida. Together with all or parts of the separate islands of Dredgers Key, Fleming Key, Sunset Key, and the northern part of Stock Island, it constitutes the City of Key West. The Island of Key West is about 4 miles (6 kilometers) long and 1 mile (2 km) wide, with a total land area of 4.2 square miles (11 km2). It lies at the southernmost end of U.S. Route 1, the longest north–south road in the United States. Key West is about 95 miles (153 km) north of Cuba at their closest points. It is also 130 miles (210 km) southwest of Miami by air, about 165 miles (266 km) by road, and 106 miles (171 km) north-northeast of Havana."
                }, 
                {
                    "chapter": "The Southernmost City in the Continental United States",
                    "paragraph": "Key West is surrounded by the beautiful waters of the Atlantic Ocean and the Gulf of Mexico. Dive the Vandenberg or snorkel our coral reefs, charter a day of fishing, relax on one of our beaches, book an Eco tour, and end your day with a beautiful sunset cruise. Each evening we are treated to the talented Sunset Celebration performers on Mallory Square while enjoying a spectacular sunset."
                }
        ], 
        "slider": {
            "images": 
                [
                     "https://upload.wikimedia.org/wikipedia/commons/2/28/Flag_of_Key_West%2C_Florida.svg",
                     "https://upload.wikimedia.org/wikipedia/commons/2/24/Seal_of_Key_West%2C_Florida.png",
                     "https://upload.wikimedia.org/wikipedia/commons/8/82/1542644843_48446_o.jpg", 
                     "https://upload.wikimedia.org/wikipedia/commons/f/f7/Key_west_from_iss.jpg", 
                     "https://upload.wikimedia.org/wikipedia/commons/0/0e/Key_cruise.jpg", 
                     "https://upload.wikimedia.org/wikipedia/commons/f/f7/Flag_of_Florida.svg"
                ], 
                "descriptions": 
                    [
                      "The flag of the Key West", 
                      "The seal of the Key West", 
                      "Teri Johnston - the mayor of the Key West", 
                      "Key West from satelite", 
                      "A cruise ship docked at the Navy Mole pier in Key West", 
                      "The flag of the Florida"
                    ], 
                "urls": [
                    "https://upload.wikimedia.org/wikipedia/commons/2/28/Flag_of_Key_West%2C_Florida.svg",
                    "https://upload.wikimedia.org/wikipedia/commons/2/24/Seal_of_Key_West%2C_Florida.png", 
                    "https://upload.wikimedia.org/wikipedia/commons/8/82/1542644843_48446_o.jpg", 
                    "https://upload.wikimedia.org/wikipedia/commons/f/f7/Key_west_from_iss.jpg", 
                    "https://upload.wikimedia.org/wikipedia/commons/0/0e/Key_cruise.jpg", 
                    "https://upload.wikimedia.org/wikipedia/commons/f/f7/Flag_of_Florida.svg"
                ], 
                "colors": [
                    "#232365", 
                    "#111188", 
                    "#555577", 
                    "#333355", 
                    "#111133", 
                    "#000055"
                ]
        }
    }
}
